---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.Insert(Autodesk.Revit.DB.Element)
source: html/1b0bcd96-994a-1ddd-2584-112cfc13aaa6.htm
---
# Autodesk.Revit.DB.ElementSet.Insert Method

Insert the specified element into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	Element item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Element`) - The element to be inserted into the set.

## Returns
Returns whether the element was inserted into the set.